apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_wifi_adapter.c
  return (void *)((uintptr_t)pid);
}

/****************************************************************************
 * Name: esp_task_get_max_priority
 *
 * Description:
 *   Get OS task maximum priority
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Task maximum priority
 *
 ****************************************************************************/

static int32_t esp_task_get_max_priority(void)
{
  return SCHED_PRIORITY_MAX;
}

/****************************************************************************
 * Name: esp_malloc
 *
 * Description:
 *   Allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void *esp_malloc(unsigned int size)
{
  return kmm_malloc(size);
}

/****************************************************************************
 * Name: esp_free
 *
 * Description:
 *   Free a block of memory
 *
 * Input Parameters:
 *   ptr - memory block
 *
 * Returned Value:
 *   No
 *
 ****************************************************************************/

static void esp_free(void *ptr)
{
  kmm_free(ptr);
}

/****************************************************************************
 * Name: esp_event_id_map
 *
 * Description:
 *   Transform from esp-idf event ID to Wi-Fi adapter event ID
 *
 * Input Parameters:
 *   event_id - esp-idf event ID
 *
 * Returned Value:
 *   Wi-Fi adapter event ID
 *
 ****************************************************************************/

static int esp_event_id_map(int event_id)
{
  int id;

  switch (event_id)
    {
      case WIFI_EVENT_SCAN_DONE:
        id = WIFI_ADPT_EVT_SCAN_DONE;
        break;

#ifdef ESP32C3_WLAN_HAS_STA
      case WIFI_EVENT_STA_START:
        id = WIFI_ADPT_EVT_STA_START;
        break;

      case WIFI_EVENT_STA_CONNECTED:
        id = WIFI_ADPT_EVT_STA_CONNECT;
        break;

      case WIFI_EVENT_STA_DISCONNECTED:
        id = WIFI_ADPT_EVT_STA_DISCONNECT;
        break;

      case WIFI_EVENT_STA_AUTHMODE_CHANGE:
        id = WIFI_ADPT_EVT_STA_AUTHMODE_CHANGE;
        break;

      case WIFI_EVENT_STA_STOP:
        id = WIFI_ADPT_EVT_STA_STOP;
        break;
#endif

#ifdef ESP32C3_WLAN_HAS_SOFTAP
      case WIFI_EVENT_AP_START:
        id = WIFI_ADPT_EVT_AP_START;
        break;

      case WIFI_EVENT_AP_STOP:
        id = WIFI_ADPT_EVT_AP_STOP;
        break;

      case WIFI_EVENT_AP_STACONNECTED:
        id = WIFI_ADPT_EVT_AP_STACONNECTED;
        break;

      case WIFI_EVENT_AP_STADISCONNECTED:
        id = WIFI_ADPT_EVT_AP_STADISCONNECTED;
        break;
#endif

      default:
        return -1;
    }

  return id;
}

/****************************************************************************
 * Name: esp_evt_work_cb
 *
 * Description:
 *   Process the cached event
 *
 * Input Parameters:
 *   arg - No mean
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp_evt_work_cb(void *arg)
{
  int ret;
  irqstate_t flags;
  wifi_ps_type_t ps_type = DEFAULT_PS_MODE;
  struct evt_adpt *evt_adpt;
  struct wifi_notify *notify;
  wifi_event_sta_disconnected_t *disconnected;

  while (1)
    {
      flags = enter_critical_section();
      evt_adpt = (struct evt_adpt *)sq_remfirst(&g_wifi_evt_queue);
      leave_critical_section(flags);
      if (!evt_adpt)
        {
          break;
        }

      /* Some of the following logic (eg. esp32c3_wlan_sta_set_linkstatus)
       * can take net_lock(). To maintain the consistent locking order,
       * we take net_lock() here before taking esp_wifi_lock. Note that
       * net_lock() is a recursive lock.
       */

      net_lock();
      esp_wifi_lock(true);

      switch (evt_adpt->id)
        {
          case WIFI_ADPT_EVT_SCAN_DONE:
            esp_wifi_scan_event_parse();
            break;

#ifdef ESP32C3_WLAN_HAS_STA
          case WIFI_ADPT_EVT_STA_START:
            wlinfo("INFO: Wi-Fi sta start\n");
            g_sta_connected = false;
#ifdef CONFIG_ESP32C3_BLE
            if (esp32c3_bt_controller_get_status() !=
                  ESP_BT_CONTROLLER_STATUS_IDLE)
              {
                if (ps_type == WIFI_PS_NONE)
                  {
                    ps_type = WIFI_PS_MIN_MODEM;
                  }
              }
#endif
            ret = esp_wifi_set_ps(ps_type);
            if (ret)
              {
                wlerr("ERROR: Failed to close PS\n");
              }
            else
              {
                wlinfo("INFO: Set ps type=%d\n", ps_type);
              }

            break;

          case WIFI_ADPT_EVT_STA_CONNECT:
            g_channel = 0;
            wlinfo("INFO: Wi-Fi sta connect\n");
            g_sta_connected = true;
            ret = esp32c3_wlan_sta_set_linkstatus(true);
            if (ret < 0)
              {
                wlerr("ERROR: Failed to set Wi-Fi station link status\n");
              }

            break;

          case WIFI_ADPT_EVT_STA_DISCONNECT:
            disconnected = (wifi_event_sta_disconnected_t *)evt_adpt->buf;
            wlinfo("INFO: Wi-Fi sta disconnect, reason code: %d\n",
                                              disconnected->reason);
            if ((disconnected->reason == WIFI_REASON_CONNECTION_FAIL ||
                 disconnected->reason == WIFI_REASON_NO_AP_FOUND ||
                 disconnected->reason == WIFI_REASON_AUTH_EXPIRE ||
                 disconnected->reason == WIFI_REASON_ASSOC_EXPIRE ||
                 disconnected->reason == WIFI_REASON_AUTH_FAIL) &&
                 g_sta_block && (g_retry_cnt++ < WIFI_RECONNECT_COUNT))
              {
                ret = esp_wifi_sta_connect_wrapper();
                if (ret)
                  {
                    wlerr("ERROR: Failed to reconnect AP error=%d\n", ret);
                  }
              }
            else
              {
                if (g_sta_block)
                  {
                    g_sta_block = false;
                  }

                g_channel = 0;
                g_sta_connected = false;
                ret = esp32c3_wlan_sta_set_linkstatus(false);
                if (ret < 0)
                  {
                    wlerr("ERROR: Failed to set Wi-Fi\
                           station link status\n");
                  }
#ifdef CONFIG_ESP32C3_WIFI_RECONNECT
                if (g_sta_reconnect)
                  {
                    ret = esp_wifi_connect();
                    if ((ret != WIFI_STA_STATE_OK) &&
                       (ret != WIFI_STA_STATE_PENDING))
                      {
                        wlerr("ERROR: Failed to connect AP error=%d\n", ret);
                      }
                  }
#endif
              }

            break;

          case WIFI_ADPT_EVT_STA_STOP:
            wlinfo("INFO: Wi-Fi sta stop\n");
            g_sta_connected = false;
            if (g_sta_block)
              {
                g_sta_block = false;
              }

            break;
#endif

